Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P28.tmx
Source language: en_us
Languages: zh_cn

source: Another Manhattan
zh_cn: 再来一杯曼哈顿

source: They had lied to each other so many times, over so many years, that deceptions between them had become commonplace, practically repertoire.
zh_cn: 多年来，他们相互撒谎很多次，相互欺骗也成为常事，几乎成了他们间的全部节目。

source: Everyone knew this about them--it wasn't news among their friends.
zh_cn: 关于这点，所有人都知道，更不是他们朋友圈里的新闻。

source: That night, they had dinner reservations with Elliot and Susan, who were accustomed to following the shifts in attitude and tone--Kate's theatrical sighs, for instance, in reaction to Jim's mournful looks across the table at her--brought on by the strain of living in an atmosphere of worry and betrayal.
zh_cn: 那晚，他们预定了位置，要和艾略特、苏珊共进晚餐。艾略特和苏珊已经习惯了关注他俩态度和语气的转变。比如凯特的夸张叹息，就是回应吉姆隔着桌子看她的忧伤眼神。吉姆这种眼神，又是因为生活在不忠和烦恼的紧张气氛里十分紧张。

source: It was winter, and dark, and the air in their little apartment was dry and nauseatingly warm; and yet what they needed, it seemed to Jim, was not to flee their home for another night of exciting conversational pauses and sly four-way flirting.
zh_cn: 正值冬天傍晚，他们狭小公寓里空气干燥，温暖得令人作呕。然而对于吉姆来说，他们想要的不是从家逃离，晚上坐到一起，兴奋地谈话、休息；也不是四个人各怀心思，相互调情。

source: They needed to sit down together, no matter how stuffy it got in the living room, no matter how loudly the radiators hissed and banged, and take turns speaking their minds.
zh_cn: 他们需要的是，不管客厅里有多闷，不理散热器发出的嘶嘶砰砰声有多吵，都坐到一起，轮流说出自己的心声。

source: They had to talk.
zh_cn: 他们必须得谈谈。

source: But first he would stop at the florist's on his way home from the outpatient clinic.
zh_cn: 但首先，在从门诊诊所回家的路上，他准备在花店停一会儿。

source: If he walked through the door carrying a bouquet, there was a chance that Kate might smile.
zh_cn: 他要是抱着花束走进门，凯特脸上可能会露出微笑。

source: There was a chance also that it wouldn't look awkward or strange when, at the end of the evening--he didn't really believe that he and Kate would be staying in--he paired with Susan for the walk through the cold, from the restaurant to Elliot's car.
zh_cn: 也有另外一种可能——晚宴结束后（吉姆确信他们晚上不会呆在家里不出去），他携着凯特穿过寒风，从餐厅走向艾略特的汽车时，看上去不至于尴尬，奇怪。

source: It might look, in other words, as if he were not bothered by Kate's whispering to another man.
zh_cn: 也可能让自己看起来好像并未因凯特与另外一个男人耳语而困扰。

source: (She had a way, with Elliot, of bowing her head and mumbling furiously through the strands of hair that fell across the side of her face, so that, in order to make out her words, Elliot was forced to stoop and lean into the fog of her breath.)
zh_cn: 凯特与艾略特讲话时，习惯低着头，头发滑下遮在脸侧，说话叽叽咕咕，语速又快。为了听清楚凯特的话，艾略特不得不屈身，把头偏进凯特呼出的热气里。

source: Jim's own affair, his affair with Susan, had been over for almost five months, long enough, he thought, as he approached the florist's on the corner by his and Kate's building, for him to begin experimenting--later that same night, if the mood was right--with innocently putting his arm around Susan's shoulder while she and he and Kate and Elliot walked in two sets of two toward the parking garage.
zh_cn: 吉姆自己与苏珊的恋情，已经结束快五个月了。他觉得够久了。想着，他已经快到花店了，就在他和凯特所住楼房的拐角。晚上迟些时候，如果心情不错的话，他要开始他的实验——苏珊与他，凯特与艾略特，成双成对走向停车场时，他要单纯地搂住苏珊的肩膀。

source: Of course, he wanted to be careful not to punish Kate, or, at least, not to seem to punish her, for her success in adultery.
zh_cn: 当然，他只是想表现得细心些，并非因为凯特不忠而想惩罚她，至少看起来不像是惩罚她。

source: Elliot made her laugh--in a sweet way.
zh_cn: 艾略特逗苏珊笑，方法甜蜜。

source: Anyone meeting them for the first time would think they were a new couple.
zh_cn: 第一次碰见他们的人，都会认为他们是新结合的一对情侣。

source: It was wrong to hate her.
zh_cn: 他不应该憎恨凯特。

source: He'd arrived at the florist's. Inside, he went straight over to the roses in their refrigerated case.
zh_cn: 他已经到达花店。花店里，他直接走向装玫瑰的冷柜。

source: Though it was a cold day, cold and very windy, and he'd come in chilled, the short walk across the heated space warmed him, and he could feel the frigid air hit him in the face when he yanked open the glass door.
zh_cn: 天气很冷，风很大，他走进来时已经冻透了。但是在有暖气的屋内走了短短几步，他便暖和起来，猛然拉开冷柜玻璃门，还能感觉到冷气铺面而来。

source: He leaned in and peered at the flowers. He asked the girl, "Do you have yellow roses that haven't already bloomed and, you know, opened?"
zh_cn: 他俯身看着玫瑰花，问那女孩：“有没有还没绽放的黄玫瑰？你知道，就是还没开放的。”

source: Yellow roses, signifying friendship more than eros, seemed right, given the complex potentials of the evening.
zh_cn: 黄玫瑰更多时候象征友爱，而非情爱。鉴于晚上有各种可能性，十分复杂，所以黄玫瑰似乎比较合适。

source: "We only have these."
zh_cn: “只有这些。”

source: "They're pretty, but they're not going to last."
zh_cn: “它们很漂亮，但是开不了多久。”

source: She was pretty as well, the girl showing him roses.
zh_cn: 给他看玫瑰的那女孩，也很漂亮。

source: Had he seen her in here before and somehow not noticed?
zh_cn: 吉姆之前在这见过她，却又不知怎地没有注意？

source: How old was she?
zh_cn: 她年纪多大？

source: Should he risk looking into her eyes?
zh_cn: 要不要冒险看看她双眼？

source: Was she wearing a ring?
zh_cn: 有没有戴戒指？

source: What about her ass?
zh_cn: 屁股怎样？

source: And what had he said to her just now? Blooming and opening meant the same thing in relation to flowers.
zh_cn: 吉姆刚才问她什么，关于花，绽放和开放就是一回事。

source: He'd become inarticulate in her presence.
zh_cn: 在她面前，吉姆不会说话了。

source: Kate, in the meantime, was upstairs in the apartment, talking on the phone to Elliot. The call had gone on for more than five hours.
zh_cn: 与此同时，凯特在楼上公寓里，正和艾略特打电话，已经打了五个多小时。

source: Kate had had to use all available phones: her cell phone and, before the cell, the apartment's two cheap cordless handsets, one in the kitchen and one in the bedroom.
zh_cn: 她不得不用尽所有能用的电话。她用了自己的手机。之前还用了公寓里两部便宜的无绳电话，一部在厨房，一部在卧室。

source: "Can you hear beeping?
zh_cn: “你听见电话嘟嘟响没？

source: I've got to switch phones. Hang on," she'd exclaimed when the kitchen phone's battery began dying.
zh_cn: 我得换电话，等等。”她叫道。厨房里那部电话快没电了。

source: Carrying that phone (her first of the call), she'd gone into the bedroom, picked up its brother from the night table, and said, into this new phone, "Are you there? Can you hear me? Hold on while I hang up the other phone," after which she'd taken both phones to the kitchen and dropped the dead one into its cradle on the wall.
zh_cn: 她拿着电话（她最先用的就是这部）走进卧室，从床头柜上拾起另一部电话——厨房里那部的兄弟。然后对着新电话说：“你还在吗？能听得见吗？等等我挂掉那电话。”说完，她便拿着两个电话走进厨房，把没电的那部挂到墙上底座里。

source: A small cabinet door beside this phone opened onto a narrow and dark airshaft that had once housed a dumbwaiter.
zh_cn: 电话边上的橱柜开着一扇小门，开到一个阴暗狭小的通风井上，里面曾经安装过升降机。

source: Kate opened and closed this empty cabinet several times while explaining, on the bedroom phone, why Elliot's being married and her being married shouldn't necessarily be considered something they had in common.
zh_cn: 凯特打开空橱柜的门，然后又关上，反反复复。同时又对着卧室里那部电话向艾略特解释，为什么绝对不能把艾略特和她都已婚视为他们的共同之处。

source: That they were both childless could stand as an area of emotional parity, she felt, considering the fact that they both remained unsure as to whether to have children, while their spouses frequently made it clear that, in their opinions--Susan's specifically regarding Elliot, Jim's specifically regarding Kate, and neither Susan nor Jim meaning to suggest a marital reconfiguration--they'd make "a great dad" or "a great mom."
zh_cn: 凯特觉得她和艾略特都没有孩子是情感上的平等。他们俩都还不确定要不要孩子，但是他们的伴侣——艾略特指的是苏珊，凯特指的是吉姆，都没有指自己是对方的伴侣——总是明说要作个“好爸爸”、“好妈妈”。

source: Elliot interrupted: "Don't you get tired of hearing that?"
zh_cn: 艾略特打断了她：“你还没有听厌烦吗？”

source: "It's beside the point," Kate answered, and went on, "Oh, Elliot, why is talking to you so damn fucking difficult?"
zh_cn: “这不是重点。”凯特回答他。然后继续说：“哎，艾略特，为什么和你谈话就他妈的这么难呢？”

source: "Do you need an answer?"
zh_cn: “你想知道为什么吗？”

source: "You know me, always curious."
zh_cn: “我一直很好奇，你是晓得的。”

source: How stupid was that?
zh_cn: 真傻。

source: She'd been trying, not for the first time, to lovingly make clear to Elliot why she could no longer sleep with him.
zh_cn: 已经不是头回了，凯特一直煞费苦心，试图向艾略特澄清为什么再不能和他上床。

source: During the first hours of the conversation she'd been able to control the impulse to bait and flirt.
zh_cn: 谈话开始的几个小时里，凯特还能控制自己想和艾略特挑逗调情的冲动。

source: But the business of swapping phones, the walking from room to room in the stuffy apartment, had, as it were, weakened her.
zh_cn: 但是在沉闷的公寓房间走来走去，不停地更换电话，可以说已经让她清醒过来。

source: It was as if, in losing that first phone, she'd lost a line of defense, however symbolic, against Elliot's desire.
zh_cn: 似乎第一次电话断线时，她对于艾略特欲望的防线也断了。

source: Or maybe, she thought as she stood in the kitchen, opening and closing the dumbwaiter door with one hand, the necessary act of sacrificing one phone for another could be read as a veiled enactment of the sort of ambivalence required for alternating between lovers in the first place.
zh_cn: 又或者，当她站在厨房，单手开关着升降机门时，她想的是，牺牲一部电话，再换用另一部，可以解读为一种模糊的演绎，演绎她从一开始轮换于两个情人之间产生的矛盾心理。

source: Or was that too absurd?
zh_cn: 这是不是太荒唐了？

source: "Say that once more. I didn't hear what you were saying," she said to Elliot.
zh_cn: “再说一遍，我没有听到你说什么。”她对艾略特说。

source: The heating pipes banged; day was turning to dusk.
zh_cn: 暖气管道发出巨响；白天渐渐进入黄昏。

source: She listened to the hiss of steam escaping from the radiator beneath the kitchen window.
zh_cn: 她听着厨房窗户下暖气片里逃逸出来的嘶嘶声。

source: Elliot began again, "I was saying that I sometimes think that you think that because I'm a psychiatrist I can automatically see all the different sides of a situation.
zh_cn: 艾略特又开始说：“我是说，我有时觉得你那样想，是因为我是精神病医生，我能顺理成章地看到情况的所有不同面。

source: But I'm not that kind of psychiatrist."
zh_cn: 不过，我不是这种精神病医生。”

source: "Please don't talk to me like I'm one of your postdocs," she said, and he took a long breath.
zh_cn: “麻烦不要那样和我说话，好像我是你的博士后学生一样。”她作了次漫长的呼吸，说道。

source: He said, "Kate, we're involved with each other, Kate."
zh_cn: 他说：“凯特，你我是有感情关系的。凯特。”

source: "Jim's your friend."
zh_cn: “吉姆是你的朋友。”

source: "And so are you my friend."
zh_cn: “你也是我的朋友。”

source: "Your wife is my friend, too."
zh_cn: “你妻子也是我的朋友。”

source: She continued, "Fuck, I hate this. Now this motherfucking phone is beeping.
zh_cn: 她继续道。“妈的，我讨厌这电话，又开始响了。

source: Hold on. Elliot, can you hold on?"
zh_cn: 等等，艾略特，能不能等一会？”

source: She swapped the bedroom phone for the insufficiently charged kitchen phone, went with that phone back into the bedroom, and sat on the edge of the bed.
zh_cn: 她把卧室里的电话换成了厨房里的那部。那部电话还没有充足电。她拿着电话走回卧室，坐到了床沿上。

source: "Kate, why are you bringing up Susan?
zh_cn: “凯特，你为什么要提苏珊啊？

source: I need to know what your point is.
zh_cn: 我得知道你的想法。

source: We agreed that we weren't going to talk about Susan. So where are you going with this?
zh_cn: 我们说好不谈苏珊的，你提她做什么？

source: Kate? Are you there?"
zh_cn: 凯特，你还在吗？”

source: He waited.
zh_cn: 他等候着。

source: "Will you talk to me?
zh_cn: “你要不要说话？

source: Please, don't do this.
zh_cn: 拜托，别这样。

source: Don't do this, Kate.
zh_cn: 别这样，凯特。

source: All right, fuck this, fuck this, fuck--"
zh_cn: 好吧。妈的......”

source: His phone was beeping. It wasn't the battery. It was another call.
zh_cn: 他电话响了，不是电池的原因，是另外有人给他打电话。

source: He said, "Kate, hang on a minute.
zh_cn: 他说：“凯特，等等。

source: Hang on, Kate."
zh_cn: 等一会，凯特。”

source: He took the call. "Hello?"
zh_cn: 他接了电话：“喂？”

source: "It's me," she said, and then informed him in a miserable voice that both her home phones were dead, and that she was on her cell phone and just wanted to say that she didn't much enjoy dishonesty.
zh_cn: “是我。”凯特说道，然后用痛苦的声音告诉艾略特，她家里的电话全没电了，她现在用着她手机，刚才正想说她一点都不喜欢不诚实的做法。

source: "You'll have to speak up," he said.
zh_cn: “那你就得和吉姆讲清楚。”他说。

source: "Can you hear me?
zh_cn: “你听得见吗？

source: Tell me when the signal is clear."
zh_cn: 信号清楚了告诉我。”

source: She pressed the cell phone against her ear and walked from the bedroom to the living room, then into the kitchen, then straight down the hall, passing the tiny second bathroom, with the broken, unusable toilet, to the apartment's miniature front foyer.
zh_cn: 她把电话听筒摁到耳朵上，然后从卧室走到客厅，再走到厨房，然后径直走下走廊，走向公寓的狭小前厅。途中路过极小的第二洗手间，里面的马桶已经坏掉，不能用了。

source: "Here?" she said. "Here?"
zh_cn: “喂？喂？”她说。

source: "I'm losing you," he said.
zh_cn: “我听不见。”艾略特说。

source: And so she retraced her route, winding up back in the living room, where she turned on a lamp.
zh_cn: 因此，她又顺着刚才的路线，绕着上楼，回到了客厅里，打开了客厅里的一盏灯。

source: The sky was dark. Everywhere on the city's horizon she saw other people's lit windows.
zh_cn: 天空黑暗无光，她视野里的城市，每处都是别人光亮的窗户。

source: Once again, Elliot had bullied her--or she'd let him bully her--into leaving open the question of their affair.
zh_cn: 艾略特又一次逼她，或者说她自己让艾略特逼的，搞得自己不能理清感情问题。

source: What was the use in arguing, anyway?
zh_cn: 争吵到底有什么用呢？

source: Jim would come home any minute, and, a little later, the two of them would go out and meet Elliot and Susan for dinner.
zh_cn: 吉姆随时会回家来，而且过一会他们俩就会出去，与艾略特和苏珊一起吃饭。

source: How crazy was that? She still had to shower and dress.
zh_cn: 真疯狂，她还得冲凉，还得打扮。

source: She conceded to Elliot, "All right, I'll think about it."
zh_cn: 她答应艾略特：“好吧，我会考虑的。”

source: "Tomorrow, then?" Elliot said, and added, "I knew you'd come to your senses." He joked that if he didn't get out of his office in the next few minutes he'd be forced to show up at the restaurant in his white coat.
zh_cn: “那明天如何？”艾略特说。接着又补充道：“我知道你不会做傻事的。”他开玩笑说如果他不在几分钟内离开办公室，他就得穿着白大褂到去饭店了。

source: They said goodbye, and she put down the phone and wept for a quarter of an hour.
zh_cn: 他们说了再见，凯特放下电话，哭泣了一刻钟。

source: Downstairs at the florist's, Jim's bouquet for Kate was growing and growing.
zh_cn: 楼下花店里，吉姆给凯特的花束越来越大。

source: It featured not only yellow roses but red and pink solitaires, along with sprigs of heather, freesia, and alstroemeria; green and white calla lilies; blue irises; mums; and some other things the girl had plucked from buckets and waved in the air for him to see and approve.
zh_cn: 花束中的主角不仅有黄玫瑰，还有单枝的红玫瑰、粉玫瑰，小枝的石楠、小苍兰、秘鲁百合；加上绿色和白色的马蹄莲、蓝色的鸢尾花、菊花，以及其它一些品种，女孩从花篮中抽出，在空中挥舞，让他看看是否认同。

source: "What else?
zh_cn: “其它的呢？

source: What does she like?" she'd asked him, as she leaned into the refrigerator and reached for more.
zh_cn: 她喜欢什么花？”女孩边问他，边倚靠在冷柜上，伸手去拿更多的花。

source: "That looks so nice.
zh_cn: “看起来真漂亮。

source: I think she'll like just what you like," he said, and wondered whether it was O.K. for him to have said it. Was it provocative?
zh_cn: 我觉得你喜欢的，她就会喜欢。”他答道。心里想他这样说是否合适，是否有些挑逗意味？

source: There were no other customers in the shop.
zh_cn: 店里没有其他顾客。

source: Staying close but keeping his distance, he followed the girl from one display case to another.
zh_cn: 他靠近女孩，却又保持着距离，跟着女孩从一个花柜走到另一个花柜。

source: He might as well have been buying lingerie, he felt; and, in fact, it seemed to him that the bouquet was somehow intended for the girl, as much as for Kate, who would've been, well, not exactly mortified to know that her husband was downstairs using a shopgirl as a proxy to get himself worked up for sex later that night.
zh_cn: 他觉得他最好是在买女式内衣；其实，他似乎就是为这女孩买的花束，感觉像是为凯特买的一样。而凯特，要是知道丈夫在楼下用女店员作替代品，为晚上的性爱热身，应该也不会真的伤心。

source: "Baby's breath," the girl said to him.
zh_cn: “满天星。”女孩对他说。

source: "Excuse me?"
zh_cn: “什么？”

source: "I love baby's breath."
zh_cn: “我喜欢满天星。”

source: "In that case, we'll have to have a bunch," Jim said.
zh_cn: “那样的话，我得要一束。”吉姆说。

source: "Good."
zh_cn: “好的。”

source: She turned away, laid the unfinished bouquet on its side on the countertop beside the cash register, and, with her back to him, said, "We have a lot to work with here."
zh_cn: 她把还未装点完成的花束平放在收银机边上的工作台上，转过身子，然后背对着吉姆说：“我们要做很多工作整理花束。”

source: She glanced back over her shoulder (did she want him to come closer?), then, quickly--what a great flirt, he thought--turned away again and set to work breaking down the bouquet and separating the flowers into groups, a variegated series of stacks that she arranged not by color or type (except in the case of the combined red, pink, and yellow roses) but, as became clear, by stem length.
zh_cn: 她回头瞟了一眼（是想吉姆再靠近些吗？），然后又快速转过去——多棒的调情啊，他想——开始打散花束，把花分开成几种。一堆颜色混杂的花，除了红、粉、黄玫瑰的组合外，她没有按颜色或者种类整理，但是很明显，她是按长度整理的。

source: When she had her piles, she picked up clippers.
zh_cn: 整理完成后，她拿起了剪刀。

source: "This will take a minute," she said.
zh_cn: “这很快的。”她说。

source: He watched her snip the stems. He said, "Take your time."
zh_cn: 他看着女孩修剪根茎，说道：“不着急。”

source: But there was a problem: what were these flowers going to cost?
zh_cn: 可是有一个问题：这些花要多少钱呢？

source: The bouquet as she assembled it--as it came to be, in her hands--was broader and taller by far than what he'd come into the florist's wanting.
zh_cn: 女孩把花束拿在手里，包了起来。现在花束已经比吉姆进来时想要的更大，更长。
